{
    "1": {
        "Rank": "1",
        "Year": "2008",
        "Outline": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, the caped crusader must come to terms with one of the greatest psychological tests of his ability to fight injustice.",
        "Genre": "Action | Crime | Drama",
        "Runtime": "152 mins",
        "Certificate": "PG_13"
    },
    "2": {
        "Rank": "2",
        "Year": "2016",
        "Outline": "When Iraq invades Kuwait in August, 1990, a callous Indian businessman becomes the spokesperson for more than 170,000 stranded countrymen.",
        "Genre": "Action | Biography | Drama | History | Thriller",
        "Runtime": "130 mins",
        "Certificate": ""
    },
    "3": {
        "Rank": "3",
        "Year": "2010",
        "Outline": "A thief, who steals corporate secrets through use of dream-sharing technology, is given the inverse task of planting an idea into the mind of a CEO.",
        "Genre": "Action | Mystery | Sci-Fi | Thriller",
        "Runtime": "148 mins",
        "Certificate": "PG_13"
    },
    "4": {
        "Rank": "4",
        "Year": "1980",
        "Outline": "After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.",
        "Genre": "Action | Adventure | Fantasy | Sci-Fi",
        "Runtime": "124 mins",
        "Certificate": "PG"
    },
    "5": {
        "Rank": "5",
        "Year": "2002",
        "Outline": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
        "Genre": "Action | Adventure | Drama | Fantasy",
        "Runtime": "179 mins",
        "Certificate": "PG_13"
    },
    "6": {
        "Rank": "6",
        "Year": "1999",
        "Outline": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.",
        "Genre": "Action | Sci-Fi",
        "Runtime": "136 mins",
        "Certificate": "R"
    },
    "7": {
        "Rank": "7",
        "Year": "2013",
        "Outline": "Vishwanathan, a Kathak dance teacher in New York, is in a rather happy marriage with Nirupama who is a nuclear oncologist...",
        "Genre": "Action | Adventure | Crime | Mystery | Thriller",
        "Runtime": "148 mins",
        "Certificate": ""
    },
    "8": {
        "Rank": "8",
        "Year": "1977",
        "Outline": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookiee and two droids to save the galaxy from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader.",
        "Genre": "Action | Adventure | Fantasy | Sci-Fi",
        "Runtime": "121 mins",
        "Certificate": "PG"
    },
    "9": {
        "Rank": "9",
        "Year": "2014",
        "Outline": "A rock star must overcome his psychological inhibitions to seek revenge for his parents' death.",
        "Genre": "Action | Mystery | Thriller",
        "Runtime": "170 mins",
        "Certificate": ""
    },
    "10": {
        "Rank": "10",
        "Year": "2015",
        "Outline": "In ancient India, an adventurous and daring man becomes involved in a decades old feud between two warring people.",
        "Genre": "Action | Adventure | Drama | Fantasy | War",
        "Runtime": "159 mins",
        "Certificate": ""
    },
    "11": {
        "Rank": "11",
        "Year": "1998",
        "Outline": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
        "Genre": "Action | Drama | War",
        "Runtime": "169 mins",
        "Certificate": "R"
    },
    "12": {
        "Rank": "12",
        "Year": "1981",
        "Outline": "Archaeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant before the Nazis.",
        "Genre": "Action | Adventure",
        "Runtime": "115 mins",
        "Certificate": "R"
    },
    "13": {
        "Rank": "13",
        "Year": "1991",
        "Outline": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her young son, John Connor, from a more advanced cyborg, made out of liquid metal.",
        "Genre": "Action | Sci-Fi",
        "Runtime": "137 mins",
        "Certificate": "R"
    },
    "14": {
        "Rank": "14",
        "Year": "2000",
        "Outline": "When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge.",
        "Genre": "Action | Drama",
        "Runtime": "155 mins",
        "Certificate": "R"
    },
    "15": {
        "Rank": "15",
        "Year": "2013",
        "Outline": "The efforts of the Pakistani security forces in their fight against terrorism and how the lives of security officials are affected. A retired security officer returns to save Pakistan from a major terrorist attack.",
        "Genre": "Action | Drama | Thriller",
        "Runtime": "130 mins",
        "Certificate": ""
    },
    "16": {
        "Rank": "16",
        "Year": "2012",
        "Outline": "Eight years after the Joker's reign of anarchy, the Dark Knight, with the help of the enigmatic Selina, is forced from his imposed exile to save Gotham City, now on the edge of total annihilation, from the brutal guerrilla terrorist Bane.",
        "Genre": "Action | Thriller",
        "Runtime": "164 mins",
        "Certificate": "PG_13"
    },
    "17": {
        "Rank": "17",
        "Year": "1975",
        "Outline": "After his family is murdered by a notorious and ruthless bandit, a former police officer enlists the services of two outlaws to capture him.",
        "Genre": "Action | Adventure | Comedy | Drama | Musical | Thriller",
        "Runtime": "198 mins",
        "Certificate": ""
    },
    "18": {
        "Rank": "18",
        "Year": "1986",
        "Outline": null,
        "Genre": "Action | Horror | Sci-Fi",
        "Runtime": "137 mins",
        "Certificate": "R"
    },
    "19": {
        "Rank": "19",
        "Year": "1983",
        "Outline": "After rescuing Han Solo from the palace of Jabba the Hutt, the rebels attempt to destroy the second Death Star, while Luke struggles to make Vader return from the dark side of the Force.",
        "Genre": "Action | Adventure | Fantasy | Sci-Fi",
        "Runtime": "131 mins",
        "Certificate": "PG"
    },
    "20": {
        "Rank": "20",
        "Year": "2016",
        "Outline": "A former Special Forces operative turned mercenary is subjected to a rogue experiment that leaves him with accelerated healing powers, adopting the alter ego Deadpool.",
        "Genre": "Action | Adventure | Comedy | Sci-Fi",
        "Runtime": "108 mins",
        "Certificate": "R"
    },
    "21": {
        "Rank": "21",
        "Year": "2013",
        "Outline": "The truth behind the ascension of Milkha \"The Flying Sikh\" Singh who was scarred because of the India-Pakistan partition.",
        "Genre": "Action | Biography | Drama | History | Sport",
        "Runtime": "186 mins",
        "Certificate": ""
    },
    "22": {
        "Rank": "22",
        "Year": "2012",
        "Outline": "A clash between Sultan (a Qureishi dacoit chief) and Shahid Khan (a Pathan who impersonates him) leads to the expulsion of Khan from Wasseypur, and ignites a deadly blood feud spanning three generations.",
        "Genre": "Action | Crime | Drama | Thriller",
        "Runtime": "320 mins",
        "Certificate": "R"
    },
    "23": {
        "Rank": "23",
        "Year": "2015",
        "Outline": "Three decades after the defeat of the Galactic Empire, a new threat arises. The First Order attempts to rule the galaxy and only a ragtag group of heroes can stop them, along with the help of the Resistance.",
        "Genre": "Action | Adventure | Fantasy | Sci-Fi",
        "Runtime": "135 mins",
        "Certificate": "PG_13"
    },
    "24": {
        "Rank": "24",
        "Year": "1948",
        "Outline": "Fred Dobbs and Bob Curtin, two Americans searching for work in Mexico, convince an old prospector to help them mine for gold in the Sierra Madre Mountains.",
        "Genre": "Action | Adventure | Drama | Western",
        "Runtime": "126 mins",
        "Certificate": "APPROVED"
    },
    "25": {
        "Rank": "25",
        "Year": "2014",
        "Outline": "A young man returns to Kashmir after his father's disappearance to confront his uncle - the man he suspects to have a role in his father's fate.",
        "Genre": "Action | Crime | Drama | Romance | Thriller",
        "Runtime": "160 mins",
        "Certificate": ""
    },
    "26": {
        "Rank": "26",
        "Year": "2005",
        "Outline": "After training with his mentor, Batman begins his war on crime to free the crime-ridden Gotham City from corruption that the Scarecrow and the League of Shadows have cast upon it.",
        "Genre": "Action | Adventure",
        "Runtime": "140 mins",
        "Certificate": "PG_13"
    },
    "27": {
        "Rank": "27",
        "Year": "1989",
        "Outline": "When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana Jones must follow in his father's footsteps and stop the Nazis.",
        "Genre": "Action | Adventure | Fantasy",
        "Runtime": "127 mins",
        "Certificate": ""
    },
    "28": {
        "Rank": "28",
        "Year": "1985",
        "Outline": "An elderly lord abdicates to his three sons, and the two corrupt ones turn against him.",
        "Genre": "Action | Drama",
        "Runtime": "162 mins",
        "Certificate": "R"
    },
    "29": {
        "Rank": "29",
        "Year": "1926",
        "Outline": "When Union spies steal an engineer's beloved locomotive, he pursues it single-handedly and straight through enemy lines.",
        "Genre": "Action | Adventure | Comedy | Drama | War",
        "Runtime": "67 mins",
        "Certificate": "UNRATED"
    },
    "30": {
        "Rank": "30",
        "Year": "1995",
        "Outline": "A group of professional bank robbers start to feel the heat from police when they unknowingly leave a clue at their latest heist.",
        "Genre": "Action | Crime | Drama | Thriller",
        "Runtime": "170 mins",
        "Certificate": "R"
    },
    "31": {
        "Rank": "31",
        "Year": "1988",
        "Outline": "John McClane, officer of the NYPD, tries to save his wife Holly Gennaro and several others that were taken hostage by German terrorist Hans Gruber during a Christmas party at the Nakatomi Plaza in Los Angeles.",
        "Genre": "Action | Thriller",
        "Runtime": "131 mins",
        "Certificate": "R"
    },
    "32": {
        "Rank": "32",
        "Year": "2005",
        "Outline": "In a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.",
        "Genre": "Action | Drama | Thriller",
        "Runtime": "132 mins",
        "Certificate": "R"
    },
    "33": {
        "Rank": "33",
        "Year": "2015",
        "Outline": "An elite counter-intelligence unit learns of a plot, masterminded by a maniacal madman. With the clock ticking, it's up to them to track the terrorists' international tentacles and prevent them from striking at the heart of India.",
        "Genre": "Action | Crime | Thriller",
        "Runtime": "159 mins",
        "Certificate": ""
    },
    "34": {
        "Rank": "34",
        "Year": "2013",
        "Outline": null,
        "Genre": "Action | Biography | Drama | Sport",
        "Runtime": "123 mins",
        "Certificate": "R"
    },
    "35": {
        "Rank": "35",
        "Year": "2004",
        "Outline": "A drama about the fate of brothers forced to fight in the Korean War.",
        "Genre": "Action | Drama | War",
        "Runtime": "140 mins",
        "Certificate": "R"
    },
    "36": {
        "Rank": "36",
        "Year": "2015",
        "Outline": "A woman rebels against a tyrannical ruler in postapocalyptic Australia in search for her home-land with the help of a group of female prisoners, a psychotic worshipper, and a drifter named Max.",
        "Genre": "Action | Adventure | Sci-Fi | Thriller",
        "Runtime": "120 mins",
        "Certificate": "R"
    },
    "37": {
        "Rank": "37",
        "Year": "2003",
        "Outline": "The Bride wakens from a four-year coma. The child she carried in her womb is gone. Now she must wreak vengeance on the team of assassins who betrayed her - a team she was once part of.",
        "Genre": "Action",
        "Runtime": "111 mins",
        "Certificate": "R"
    },
    "38": {
        "Rank": "38",
        "Year": "2012",
        "Outline": "Earth's mightiest heroes must come together and learn to fight as a team if they are to stop the mischievous Loki and his alien army from enslaving humanity.",
        "Genre": "Action | Adventure | Sci-Fi",
        "Runtime": "143 mins",
        "Certificate": "PG_13"
    },
    "39": {
        "Rank": "39",
        "Year": "2010",
        "Outline": "After a prison riot, former-Captain Nascimento, now a high ranking security officer in Rio de Janeiro, is swept into a bloody political dispute that involves government officials and paramilitary groups.",
        "Genre": "Action | Crime | Drama | Thriller",
        "Runtime": "115 mins",
        "Certificate": "UNRATED"
    },
    "40": {
        "Rank": "40",
        "Year": "2007",
        "Outline": "Jason Bourne dodges a ruthless CIA official and his agents from a new assassination program while searching for the origins of his life as a trained killer.",
        "Genre": "Action | Thriller",
        "Runtime": "115 mins",
        "Certificate": "PG_13"
    },
    "41": {
        "Rank": "41",
        "Year": "2008",
        "Outline": "A semi-biographical account of Yip Man, the successful martial arts master who taught the Chinese martial art of Wing Chun to the world.",
        "Genre": "Action | Biography | Drama | Sport",
        "Runtime": "106 mins",
        "Certificate": "R"
    },
    "42": {
        "Rank": "42",
        "Year": "2014",
        "Outline": "A group of intergalactic criminals are forced to work together to stop a fanatical warrior from taking control of the universe.",
        "Genre": "Action | Adventure | Sci-Fi",
        "Runtime": "121 mins",
        "Certificate": "PG_13"
    },
    "43": {
        "Rank": "43",
        "Year": "2007",
        "Outline": "1997, Captain Nascimento has to find a substitute for his occupation while trying to take down drug dealers and criminals before the Pope comes to Rio de Janeiro, Brazil.",
        "Genre": "Action | Crime | Drama | Thriller",
        "Runtime": "115 mins",
        "Certificate": "R"
    },
    "44": {
        "Rank": "44",
        "Year": "1988",
        "Outline": "A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psychic psychopath that only two kids and a group of psychics can stop.",
        "Genre": "Animation | Action | Sci-Fi",
        "Runtime": "124 mins",
        "Certificate": "R"
    },
    "45": {
        "Rank": "45",
        "Year": "1984",
        "Outline": "A human-looking indestructible cyborg is sent from 2029 to 1984 to assassinate a waitress, whose unborn son will lead humanity in a war against the machines, while a soldier from that war is sent to protect her at all costs.",
        "Genre": "Action | Sci-Fi",
        "Runtime": "107 mins",
        "Certificate": "R"
    },
    "46": {
        "Rank": "46",
        "Year": "2003",
        "Outline": "Blacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.",
        "Genre": "Action | Adventure | Fantasy",
        "Runtime": "143 mins",
        "Certificate": "PG_13"
    },
    "47": {
        "Rank": "47",
        "Year": "1959",
        "Outline": "A small-town sheriff in the American West enlists the help of a cripple, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
        "Genre": "Action | Comedy | Drama | Western",
        "Runtime": "141 mins",
        "Certificate": "APPROVED"
    },
    "48": {
        "Rank": "48",
        "Year": "1964",
        "Outline": "A wandering gunfighter plays two rival families against each other in a town torn apart by greed, pride, and revenge.",
        "Genre": "Action | Drama | Western",
        "Runtime": "99 mins",
        "Certificate": "R"
    },
    "49": {
        "Rank": "49",
        "Year": "2014",
        "Outline": "The X-Men send Wolverine to the past in a desperate effort to change history and prevent an event that results in doom for both humans and mutants.",
        "Genre": "Action | Adventure | Sci-Fi | Thriller",
        "Runtime": "132 mins",
        "Certificate": "PG_13"
    },
    "50": {
        "Rank": "50",
        "Year": "1969",
        "Outline": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
        "Genre": "Action | Adventure | Western",
        "Runtime": "145 mins",
        "Certificate": "R"
    }
}